premium/tests/load/quick-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Quick test - 5 users/sec for 10 seconds"
  
  plugins:
    expect: {}
  
  variables:
    chains:
      - "ethereum"
      - "bsc"
      - "polygon"
    tokens:
      - "USDT"
      - "USDC"
      - "DAI"
  
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer test-token-premium"

scenarios:
  - name: "Create and Get Whale Alert"
    weight: 50
    flow:
      - post:
          url: "/v2/premium/alerts/whale"
          json:
            name: "Quick Test Alert {{ $randomNumber(1, 1000) }}"
            type: "whale"
            conditions:
              chain: "{{ $randomItem(chains) }}"
              token: "{{ $randomItem(tokens) }}"
              threshold_usd: "{{ $randomNumber(100000, 1000000) }}"
            actions:
              channels: ["email"]
          expect:
            - statusCode: 201
            - contentType: json
          capture:
            - json: "$.data.id"
              as: "alertId"
      
      - get:
          url: "/v2/premium/alerts/whale/{{ alertId }}"
          expect:
            - statusCode: 200
            - contentType: json
  
  - name: "Get Whale Alerts List"
    weight: 50
    flow:
      - get:
          url: "/v2/premium/alerts/whale?limit=10&offset=0"
          expect:
            - statusCode: 200
            - contentType: json